// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1
// Console.Clear();
// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine()!);
// for(int i = 1; i < n; i++){
//     if (i % 2 == 0)
//     Console.Write($"{i} ");
// }

Console.Clear();
Console.Write("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine()!);
int m = Convert.ToInt32(Console.ReadLine()!);
    if (n * n == m) {
    Console.Write("кратно");
    }   
    else 
    Console.Write("не кратно");
 